import math from '../assets/Activity/math.png'
import dara from '../assets/Activity/dara.png'
import mt from '../assets/Activity/MT.png'
import faid from '../assets/Activity/faid.png'
import dekd from '../assets/Activity/dekd.png'
import pf from '../assets/Activity/Portfolio.png'
import { faGithub } from '@fortawesome/free-brands-svg-icons'

export const data = [

        {
            title:"Portfolio Website",
            link:"",
            date:"2568",
            
            descriptions: [
                "          ผลงานชิ้นนี้ ผมคิดว่าควรจะนำเสนอพอร์ตโฟลิโออย่างไรให้มีความน่าสนใจมากยิ่งขึ้น และเนื่องจากผมไม่มีผลงานการแข่งขันมากนัก จึงเลือกที่จะนำเสนอพอร์ตโฟลิโอในรูปแบบเว็บไซต์ ตอนแรก ผมมีความรู้เกี่ยวกับ HTML น้อยมาก จึงหาเรียนจาก YouTube ซึ่งมีหลายวิธีในการสร้างเว็บไซต์ ไม่ว่าจะเป็นการใช้เว็บไซต์สำเร็จรูปที่เพียงแค่ใส่ข้อมูล หรือการเขียนโค้ดเองทั้งหมด ผมเลือกที่จะเขียนโค้ดเองทั้งหมด โดยนำข้อมูลการสอนจากหลายช่องใน YouTube มาผสมผสานกัน ในระหว่างการทำ ผมพบเจอปัญหาหลายอย่าง ซึ่งเป็นประสบการณ์ที่สนุกในการแก้ไขปัญหาด้วยตัวเองจนสำเร็จ",
                "ผมได้เรียนรู้ภาษาโปรแกรมต่างๆ เช่น Java, CSS, JSX และ HTML โดยเฉพาะอย่างยิ่ง JavaScript ที่ใช้ในการสร้างเว็บไซต์แบบอินเตอร์แอคทีฟ ในโครงงานนี้ ผมได้เลือกใช้ React.js และ Tailwind CSS เพื่อสร้างส่วนติดต่อผู้ใช้ที่สวยงามและตอบสนองได้รวดเร็ว ผมพบว่าการเรียนรู้และแก้ไขปัญหาที่เกิดขึ้นในระหว่างการพัฒนาเว็บไซต์ ช่วยให้ผมมีความเข้าใจในเทคโนโลยีเหล่านี้มากยิ่งขึ้น",
            ],
            materials: [
                {type: faGithub, link: "" },
            ],
            picture: pf,
        },
        {
            title:"ค่ายส่งเสริมทักษะด้านคณิตศาสตร์ ปีการศึกษา 2567 ",
            link:"",
            date:"2567",
            
            descriptions: [
                "          ในค่ายนี้ผมได้ทบทวนบทเรียนคณิตศาสตร ในเรื่องดอกเบี้ยทบต้น การคำนวณ ตัวแปรต่างๆ และได้เรียนรู้เกี่ยวกับ การเป็นผู้นำ",
            ],
            materials: [
            
            ],
            picture: math,
        },
        {
            title:"เข้าร่วมการอบรมพัฒนาทักษะทางด้านดาราศาสตร์ปีการศึกษา 2567 ",
            link:"",
            date:"2567",
            
            descriptions: [
                "ในค่ายนี้ผมได้ใช้ความรู้ทาง คณิตศาสตร์ ในการคำนวณ ระยะทาง ต่ำแหน่งของกลุ่มดาวบนท้องฟ้า และได้เห็นความสวยงามของหมู่ดาว",
            ],
            materials: [
            
            ],
            picture: dara,
        },
        {
            title:" “Moral Touchable” สมัชชาคุณธรรมแห่งชาติ ครั้งที่ 13",
            link:"https://www.naewna.com/lady/751229",
            date:"2567",
            
            descriptions: [
                "       ผมได้เรียนรู้ การมีคุณธรรมต่อมนุษย์ ถึงแม้ว่าคนๆนั้นจะทำผิดมา ได้อัพสกิล ภาษาอังกฤษ เพราะว่าในตัวงานี้ มีการสนทนากับนักศึกษาจากประเทศเพื่อนบ้านภายในอาเซียน",
            ],
            materials: [
            ],
            picture: mt,
        },
        {
            title:" เด็กไทย ใฝ่ดี ปีการศึกษา 2567",
            link:"",
            date:"2567",
            
            descriptions: [
                "ผมได้เป็นวิทยากรในกิจกรรมนี้ผมได้เรียนรู้ ภาวะเป็นผู้นำ การมีความซื่อสัตย์ ",
            ],
            materials: [
            ],
            picture: faid,
        },
        {
            title:" “ค่ายคุณธรรม” ปีการศึกษา 2566",
            link:"",
            date:"2567",
            
            descriptions: [
                " ผมได้เข้าร่วมกิจกรรม ค่ายคุณธรรม ในกิจกรรมนี้ผมได้เรียนรู้การช่วยเหลือผู้อื่น การมีความสามัคคี ",
            ],
            materials: [
            ],
            picture: dekd,
        },
    ]